OpenFOAM/OpenFOAM-2.2.x/tutorials/heatTransfer/chtMultiRegionFoam/snappyMultiRegionHeater/system/README
fvSolution is used for outer correctors specification.
fvSchemes is only so that pre-processing activities can proceed

